In [2]:
import pandas as pd

In [2]:
# Calling DataFrame constructor 
df = pd.DataFrame() 
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
# To create data frame, import pandas as pd

# list of strings
list_obj = ["Nikita Asrani",
            "Pravin Galande",
            "Rayan Mariyan",
            "Sanjeevani Koli",
            "Sagar Yadav",
            "Vikram Kumar",
            "Inder Punj",
            "Manoranjan Singh",
            "Sagar Wagh"]
# Calling DataFrame constructor on list
df_obj = pd.DataFrame(list_obj)
print(df_obj)

                  0
0     Nikita Asrani
1    Pravin Galande
2     Rayan Mariyan
3   Sanjeevani Koli
4       Sagar Yadav
5      Vikram Kumar
6        Inder Punj
7  Manoranjan Singh
8        Sagar Wagh

In [4]:
# Initialize data of lists.
data = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 'Age':[23, 21, 34, 27]}

# Create DataFrame
df = pd.DataFrame(data)

# Print the output.
print(df)

     Name  Age
0  Pravin   23
1   Rayan   21
2   Sagar   34
3   Inder   27

In [9]:
append_col = {"Address": ["A", "B", "C","D"],
              "Mobile": [123, 456, 789, 102]}

get_new_col = append_col.keys()

for col in get_new_col:
    df[col] = append_col[col]

df

     Name  Age Address  Mobile
0  Pravin   23       A     123
1   Rayan   21       B     456
2   Sagar   34       C     789
3   Inder   27       D     102

### Basic operations
**Column Selection**

In [12]:
# Define a dictionary containing employee data
data = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Pune'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)

# select two columns
#print(df["Name"])
print(df[ ['Name', 'Age'] ])

     Name  Age
0  Pravin   27
1   Rayan   24
2   Sagar   22
3   Inder   32

**Row Selection**

In [14]:
data = pd.read_csv("nba.csv", index_col ="Name")

print(data)

# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
print("-----------------------------------My Output-----------------------------")
print(first,"\n\n\n",second)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
...                       ...     ...      ...   ...    ...     ...
Shelvin Mack        Utah Jazz     8.0       PG  26.0    6-3   203.0
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0
Tibor Pleiss        Utah Jazz    21.0        C  26.0    7-3   256.0
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0
NaN                       NaN     NaN      NaN   NaN    NaN     NaN

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0
...                          ...        ...
Shelvin Mack              Butler  2433333.0
Raul Neto                    NaN   900000.0
Tibor Pleiss                 NaN  2900000.0
Jeff Withey               Kansas   947276.0
NaN                          NaN        NaN

[458 rows x 8 columns]
-----------------------------------My Output-----------------------------
Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

<hr/>

### Importing and exporting data

Writing to the CSV/Excel

In [15]:
students_df = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'],
             'Age':[27, 24, 22, 32],
             'Address':['Delhi', 'Kanpur', 'Allahabad', 'Pune'],
              'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Create DataFrame
df = pd.DataFrame(students_df, columns= ['Name', 'Age', 'Address', 'Qualification'])

# Export DataFrame to CSV File
export_csv = df.to_csv(r'test_dataframe_17_apr_2020.csv', index = None, header=True)

df.to_excel(r'test_dataframe_17_apr_2020.xlsx')

print(df)

     Name  Age    Address Qualification
0  Pravin   27      Delhi           Msc
1   Rayan   24     Kanpur            MA
2   Sagar   22  Allahabad           MCA
3   Inder   32       Pune           Phd

Reading to the CSV/Excel

In [16]:
df = pd.read_csv('test_dataframe_17_apr_2020.csv')
print(df.head())

print("\n\n\n")
df = pd.read_excel(r'test_dataframe_17_apr_2020.xlsx')
print(df)

     Name  Age    Address Qualification
0  Pravin   27      Delhi           Msc
1   Rayan   24     Kanpur            MA
2   Sagar   22  Allahabad           MCA
3   Inder   32       Pune           Phd




   Unnamed: 0    Name  Age    Address Qualification
0           0  Pravin   27      Delhi           Msc
1           1   Rayan   24     Kanpur            MA
2           2   Sagar   22  Allahabad           MCA
3           3   Inder   32       Pune           Phd

<hr />

### Indexing and Selecting

In [12]:
# making data frame from csv file
data = pd.read_csv("nba.csv", index_col ="Name")

print(data)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
...                       ...     ...      ...   ...    ...     ...
Shelvin Mack        Utah Jazz     8.0       PG  26.0    6-3   203.0
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0
Tibor Pleiss        Utah Jazz    21.0        C  26.0    7-3   256.0
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0
NaN                       NaN     NaN      NaN   NaN    NaN     NaN

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0
...                          ...        ...
Shelvin Mack              Butler  2433333.0
Raul Neto                    NaN   900000.0
Tibor Pleiss                 NaN  2900000.0
Jeff Withey               Kansas   947276.0
NaN                          NaN        NaN

[458 rows x 8 columns]

In [17]:
# retrieving columns by indexing operator
college = data["College"]

print(college)

Name
Avery Bradley                Texas
Jae Crowder              Marquette
John Holland     Boston University
R.J. Hunter          Georgia State
Jonas Jerebko                  NaN
                       ...
Shelvin Mack                Butler
Raul Neto                      NaN
Tibor Pleiss                   NaN
Jeff Withey                 Kansas
NaN                            NaN
Name: College, Length: 458, dtype: object

**Indexing a DataFrame using .loc[ ]**

In [18]:
# making data frame from csv file
data = pd.read_csv("nba.csv", index_col ="Name")

# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]

print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

**Indexing a DataFrame using .iloc[ ]**

In [18]:
# making data frame from csv file
data = pd.read_csv("nba.csv", index_col ="Name")

#print(data)

# retrieving rows by iloc method 
row2 = data.iloc[200] 

print(row2)

Team        Indiana Pacers
Number                   3
Position                PG
Age                     30
Height                 6-3
Weight                 188
College              IUPUI
Salary               8e+06
Name: George Hill, dtype: object

**Iterating over rows and columns**

**Iterating over rows**

In [20]:
# Dictionary of lists
dict_obj = {'name':['Pravin', 'Rayan', 'Sagar', 'Inder'],
            'degree': ["MBA", "BCA", "M.Tech", "MBA"],
            'score':[90, 40, 80, 98]}

# Creating a dataframe from a dictionary 
df = pd.DataFrame(dict_obj)

# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      Pravin
degree       MBA
score         90
Name: 0, dtype: object

1 name      Rayan
degree      BCA
score        40
Name: 1, dtype: object

2 name       Sagar
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Inder
degree      MBA
score        98
Name: 3, dtype: object

**Iterating over Columns**

In [21]:
# Dictionary of lists
dict = {'name':['Pravin', 'Rayan', 'Sagar', 'Inder'],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict_obj)
print(df)

# creating a list of dataframe columns
columns = list(df)
print("\n")
print(columns)

print("\n")

for i in columns:
    # printing the third element of the column
    print (df[i][2])

     name  degree  score
0  Pravin     MBA     90
1   Rayan     BCA     40
2   Sagar  M.Tech     80
3   Inder     MBA     98


['name', 'degree', 'score']


Sagar
M.Tech
80

**Lowercasing and Uppercasing a Data**

In [22]:
import numpy as np

In [38]:
# Define a dictionary containing employee data 
data = {'Name':['Pravin', 'Rayan', 'Sagar', 'INDER'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Pune'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Salary': [12345.3456, 64332.6545345, 6575.9767, 543534.7655] } 

# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 

# Converting and overwriting values in column 
#df["Name"] = df["Name"].str.upper()
#df["Salary"] = df["Salary"].apply(np.floor)
df["Salary"] = df["Salary"].round(decimals=2)
df["Address"] = df["Address"].apply(lambda x: x + ', India')

dir(df.style)

df.style.bar(align="left")

**Splitting and Replacing a Data**

In [48]:
# Define a dictionary containing employee data 
data = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
        'Age':[27, 24, 22, 37], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Pune'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 

print(df)

# dropping null value columns to avoid errors 
df.dropna(inplace = True) 

#print(df)

# new data frame with split value columns 
df["Address"]= df["Address"].str.split("a", n=1, expand=True) 

# df display 
print(df)

     Name  Age    Address Qualification
0  Pravin   27     Nagpur           Msc
1   Rayan   24     Kanpur            MA
2   Sagar   22  Allahabad           MCA
3   Inder   37       Pune           Phd
     Name  Age Address Qualification
0  Pravin   27       N           Msc
1   Rayan   24       K            MA
2   Sagar   22     All           MCA
3   Inder   37    Pune           Phd

**Replace a data**

In [41]:
# reading csv file from url
data = pd.read_csv("nba.csv")

print(data)

# overwriting column with replaced value of age
data["Age"]= data["Age"].replace(25.0, "Twenty five")

print(data)

# creating a filter for age column where age = "Twenty five"
filtered_data = data["Age"] == "Twenty five"

# printing only filtered columns
df_new = data.where(filtered_data).dropna()
print('\n\n')
print(data)
print("Dropna Filtered Age")
print(df_new)

              Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]
              Name            Team  Number Position          Age Height  \
0    Avery Bradley  Boston Celtics     0.0       PG  Twenty five    6-2
1      Jae Crowder  Boston Celtics    99.0       SF  Twenty five    6-6
2     John Holland  Boston Celtics    30.0       SG           27    6-5
3      R.J. Hunter  Boston Celtics    28.0       SG           22    6-5
4    Jonas Jerebko  Boston Celtics     8.0       PF           29   6-10
..             ...             ...     ...      ...          ...    ...
453   Shelvin Mack       Utah Jazz     8.0       PG           26    6-3
454      Raul Neto       Utah Jazz    25.0       PG           24    6-1
455   Tibor Pleiss       Utah Jazz    21.0        C           26    7-3
456    Jeff Withey       Utah Jazz    24.0        C           26    7-0
457            NaN             NaN     NaN      NaN          NaN    NaN

     Weight            College     Salary
0     180.0              Texas  7730337.0
1     235.0          Marquette  6796117.0
2     205.0  Boston University        NaN
3     185.0      Georgia State  1148640.0
4     231.0                NaN  5000000.0
..      ...                ...        ...
453   203.0             Butler  2433333.0
454   179.0                NaN   900000.0
455   256.0                NaN  2900000.0
456   231.0             Kansas   947276.0
457     NaN                NaN        NaN

[458 rows x 9 columns]



              Name            Team  Number Position          Age Height  \
0    Avery Bradley  Boston Celtics     0.0       PG  Twenty five    6-2
1      Jae Crowder  Boston Celtics    99.0       SF  Twenty five    6-6
2     John Holland  Boston Celtics    30.0       SG           27    6-5
3      R.J. Hunter  Boston Celtics    28.0       SG           22    6-5
4    Jonas Jerebko  Boston Celtics     8.0       PF           29   6-10
..             ...             ...     ...      ...          ...    ...
453   Shelvin Mack       Utah Jazz     8.0       PG           26    6-3
454      Raul Neto       Utah Jazz    25.0       PG           24    6-1
455   Tibor Pleiss       Utah Jazz    21.0        C           26    7-3
456    Jeff Withey       Utah Jazz    24.0        C           26    7-0
457            NaN             NaN     NaN      NaN          NaN    NaN

     Weight            College     Salary
0     180.0              Texas  7730337.0
1     235.0          Marquette  6796117.0
2     205.0  Boston University        NaN
3     185.0      Georgia State  1148640.0
4     231.0                NaN  5000000.0
..      ...                ...        ...
453   203.0             Butler  2433333.0
454   179.0                NaN   900000.0
455   256.0                NaN  2900000.0
456   231.0             Kansas   947276.0
457     NaN                NaN        NaN

[458 rows x 9 columns]
Dropna Filtered Age
                    Name                    Team  Number Position  \
0          Avery Bradley          Boston Celtics     0.0       PG
1            Jae Crowder          Boston Celtics    99.0       SF
7           Kelly Olynyk          Boston Celtics    41.0        C
26       Thomas Robinson           Brooklyn Nets    41.0       PF
35      Cleanthony Early         New York Knicks    11.0       SF
44      Derrick Williams         New York Knicks    23.0       PF
47         Isaiah Canaan      Philadelphia 76ers     0.0       PG
48      Robert Covington      Philadelphia 76ers    33.0       SF
59       Hollis Thompson      Philadelphia 76ers    31.0       SG
71         Terrence Ross         Toronto Raptors    31.0       SF
79             Ian Clark   Golden State Warriors    21.0       SG
105          C.J. Wilcox    Los Angeles Clippers    30.0       SG
113           Ryan Kelly      Los Angeles Lakers     4.0       PF
126         John Jenkins            Phoenix Suns    23.0       SG
130         Phil Pressey            Phoenix Suns    25.0       PG
136           Quincy Acy        Sacramento Kings    13.0       SF
143     DeMarcus Cousins        Sacramento Kings    15.0        C
144           Seth Curry        Sacramento Kings    30.0       SG
151     Cameron Bairstow           Chicago Bulls    41.0       PF
166  Matthew Dellavedova     Cleveland Cavaliers     8.0       PG
175         Jordan McRae     Cleveland Cavaliers    12.0       SG
177        Iman Shumpert     Cleveland Cavaliers     4.0       SG
179     Tristan Thompson     Cleveland Cavaliers    13.0        C
184        Lorenzo Brown         Detroit Pistons    17.0       PG
185       Reggie Bullock         Detroit Pistons    25.0       SF
202         Solomon Hill          Indiana Pacers    44.0       SF
209   Shayne Whittington          Indiana Pacers    42.0       PF
214     Jared Cunningham         Milwaukee Bucks     9.0       SG
216          John Henson         Milwaukee Bucks    31.0       PF
266       JaMychal Green       Memphis Grizzlies     0.0       PF
272     Lance Stephenson       Memphis Grizzlies     1.0       SF
284          James Ennis    New Orleans Pelicans     4.0       SF
286          Tim Frazier    New Orleans Pelicans     2.0       PG
289      Jordan Hamilton    New Orleans Pelicans    25.0       SG
290         Jrue Holiday    New Orleans Pelicans    11.0       PG
366       Nikola Vucevic           Orlando Magic     9.0        C
382            John Wall      Washington Wizards     2.0       PG
385          Will Barton          Denver Nuggets     5.0       SF
404        Adreian Payne  Minnesota Timberwolves    33.0       PF
428      Al-Farouq Aminu  Portland Trail Blazers     8.0       SF
436       Damian Lillard  Portland Trail Blazers     0.0       PG

             Age Height  Weight               College      Salary
0    Twenty five    6-2   180.0                 Texas   7730337.0
1    Twenty five    6-6   235.0             Marquette   6796117.0
7    Twenty five    7-0   238.0               Gonzaga   2165160.0
26   Twenty five   6-10   237.0                Kansas    981348.0
35   Twenty five    6-8   210.0         Wichita State    845059.0
44   Twenty five    6-8   240.0               Arizona   4000000.0
47   Twenty five    6-0   201.0          Murray State    947276.0
48   Twenty five    6-9   215.0       Tennessee State   1000000.0
59   Twenty five    6-8   206.0            Georgetown    947276.0
71   Twenty five    6-7   195.0            Washington   3553917.0
79   Twenty five    6-3   175.0               Belmont    947276.0
105  Twenty five    6-5   195.0            Washington   1159680.0
113  Twenty five   6-11   230.0                  Duke   1724250.0
126  Twenty five    6-4   215.0            Vanderbilt    981348.0
130  Twenty five   5-11   175.0              Missouri     55722.0
136  Twenty five    6-7   240.0                Baylor    981348.0
143  Twenty five   6-11   270.0              Kentucky  15851950.0
144  Twenty five    6-2   185.0                  Duke    947276.0
151  Twenty five    6-9   250.0            New Mexico    845059.0
166  Twenty five    6-4   198.0          Saint Mary's   1147276.0
175  Twenty five    6-5   179.0             Tennessee    111196.0
177  Twenty five    6-5   220.0          Georgia Tech   8988765.0
179  Twenty five    6-9   238.0                 Texas  14260870.0
184  Twenty five    6-5   189.0  North Carolina State    111444.0
185  Twenty five    6-7   205.0        North Carolina   1252440.0
202  Twenty five    6-7   225.0               Arizona   1358880.0
209  Twenty five   6-11   250.0      Western Michigan    845059.0
214  Twenty five    6-4   195.0          Oregon State    947276.0
216  Twenty five   6-11   229.0        North Carolina   2943221.0
266  Twenty five    6-9   227.0               Alabama    845059.0
272  Twenty five    6-5   230.0            Cincinnati   9000000.0
284  Twenty five    6-7   210.0      Long Beach State    845059.0
286  Twenty five    6-1   170.0            Penn State    845059.0
289  Twenty five    6-7   220.0                 Texas   1015421.0
290  Twenty five    6-4   205.0                  UCLA  10595507.0
366  Twenty five    7-0   260.0                   USC  11250000.0
382  Twenty five    6-4   195.0              Kentucky  15851950.0
385  Twenty five    6-6   175.0               Memphis   3533333.0
404  Twenty five   6-10   237.0        Michigan State   1938840.0
428  Twenty five    6-9   215.0           Wake Forest   8042895.0
436  Twenty five    6-3   195.0           Weber State   4236287.0

<hr/>

### Pandas Concatenating, Merging, and Joining

**Concatenating DataFrame**

In [52]:
# Define a dictionary containing employee data  
data_obj_1 = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'],
              'Age':[27, 24, 22, 32], 
              'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Pune'], 
              'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

# Define a dictionary containing employee data 
data_obj_2 = {'Name':['Gaurav', 'Dushyen', 'Sanjeevani', 'Manoranjan'], 
              'Age':[17, 14, 12, 52], 
              'Address':['Delhi', 'Kota', 'Sangareddy', 'Kannuaj'], 
              'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

 # Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(data_obj_1,index=[0, 1, 2, 3])

# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(data_obj_2, index=[4, 5, 6, 7])

print(df_obj_1, "\n\n", df_obj_2)

# Using a .concat() method
frames = [df_obj_1, df_obj_2]
res_df = pd.concat(frames)
print("\n\n")
print(res_df)

     Name  Age    Address Qualification
0  Pravin   27     Nagpur           Msc
1   Rayan   24     Kanpur            MA
2   Sagar   22  Allahabad           MCA
3   Inder   32       Pune           Phd

          Name  Age     Address Qualification
4      Gaurav   17       Delhi         Btech
5     Dushyen   14        Kota           B.A
6  Sanjeevani   12  Sangareddy          Bcom
7  Manoranjan   52     Kannuaj        B.hons



         Name  Age     Address Qualification
0      Pravin   27      Nagpur           Msc
1       Rayan   24      Kanpur            MA
2       Sagar   22   Allahabad           MCA
3       Inder   32        Pune           Phd
4      Gaurav   17       Delhi         Btech
5     Dushyen   14        Kota           B.A
6  Sanjeevani   12  Sangareddy          Bcom
7  Manoranjan   52     Kannuaj        B.hons

**Now we set axes join = inner for intersection of dataframe**

In [43]:
# Define a dictionary containing employee data 
emp_obj_1 = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 

# Define a dictionary containing employee data 
emp_obj_2 = {'Name':['Gaurav', 'Dushyen', 'Sanjeevani', 'Manoranjan'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]}  
 
# Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(emp_obj_1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2, index=[2, 3, 6, 7]) 

print(df_obj_1, "\n\n", df_obj_2)

# Applying concat with axes join = 'inner'
res_df_2 = pd.concat([df_obj_1, df_obj_2], axis=1,join='inner')
res_df_2

     Name  Age    Address Qualification  Mobile No
0  Pravin   27     Nagpur           Msc         97
1   Rayan   24     Kanpur            MA         91
2   Sagar   22  Allahabad           MCA         58
3   Inder   32    Kannuaj           Phd         76

          Name  Age    Address Qualification  Salary
2      Gaurav   22  Allahabad           MCA    1000
3     Dushyen   32    Kannuaj           Phd    2000
6  Sanjeevani   12  Allahabad          Bcom    3000
7  Manoranjan   52    Kannuaj        B.hons    4000

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Sagar,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Inder,32,Kannuaj,Phd,76,Dushyen,32,Kannuaj,Phd,2000

**Now we set axes join = outer for union of dataframe**

In [72]:
# Using a .concat for union of dataframe
res_df_2 = pd.concat([df_obj_1, df_obj_2], axis=1, join='outer')
#res_df_2 = pd.concat([df_obj_1, df_obj_2], axis=0, sort=False)
res_df_2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Pravin,27.0,Nagpur,Msc,97.0,NaN,NaN,NaN,NaN,NaN
1,Rayan,24.0,Kanpur,MA,91.0,NaN,NaN,NaN,NaN,NaN
2,Sagar,22.0,Allahabad,MCA,58.0,Gaurav,22.0,Allahabad,MCA,1000.0
3,Inder,32.0,Kannuaj,Phd,76.0,Dushyen,32.0,Kannuaj,Phd,2000.0
6,NaN,NaN,NaN,NaN,NaN,Sanjeevani,12.0,Allahabad,Bcom,3000.0
7,NaN,NaN,NaN,NaN,NaN,Manoranjan,52.0,Kannuaj,B.hons,4000.0

**Concatenating DataFrame using .append()**

In [73]:
# Define a dictionary containing employee data 
emp_obj_1 = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 

# Define a dictionary containing employee data 
emp_obj_2 = {'Name':['Gaurav', 'Dushyen', 'Sanjeevani', 'Manoranjan'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]}  

# Convert the dictionary into DataFrame
df_obj_1 = pd.DataFrame(emp_obj_1,index=[0, 1, 2, 3])

# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2, index=[4, 5, 6, 7])

print(df_obj_1, "\n\n", df_obj_2) 

# Using append function

res_df = df_obj_1.append(df_obj_2)
print("\n\n")
res_df

     Name  Age    Address Qualification  Mobile No
0  Pravin   27     Nagpur           Msc         97
1   Rayan   24     Kanpur            MA         91
2   Sagar   22  Allahabad           MCA         58
3   Inder   32    Kannuaj           Phd         76

          Name  Age    Address Qualification  Salary
4      Gaurav   22  Allahabad           MCA    1000
5     Dushyen   32    Kannuaj           Phd    2000
6  Sanjeevani   12  Allahabad          Bcom    3000
7  Manoranjan   52    Kannuaj        B.hons    4000

         Name  Age    Address Qualification  Mobile No  Salary
0      Pravin   27     Nagpur           Msc       97.0     NaN
1       Rayan   24     Kanpur            MA       91.0     NaN
2       Sagar   22  Allahabad           MCA       58.0     NaN
3       Inder   32    Kannuaj           Phd       76.0     NaN
4      Gaurav   22  Allahabad           MCA        NaN  1000.0
5     Dushyen   32    Kannuaj           Phd        NaN  2000.0
6  Sanjeevani   12  Allahabad          Bcom        NaN  3000.0
7  Manoranjan   52    Kannuaj        B.hons        NaN  4000.0

**Concatenating DataFrame with group keys**

In [44]:
df_obj_1 = pd.DataFrame(emp_obj_1,index=[0, 1, 2, 3])

# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2, index=[4, 5, 6, 7])

print(df_obj_1, "\n\n", df_obj_2)  

# using keys 
frames = [df_obj_1, df_obj_2]

res_df = pd.concat(frames, keys=['DataF1', 'DataF2'])

print("\n")
res_df

     Name  Age    Address Qualification  Mobile No
0  Pravin   27     Nagpur           Msc         97
1   Rayan   24     Kanpur            MA         91
2   Sagar   22  Allahabad           MCA         58
3   Inder   32    Kannuaj           Phd         76

          Name  Age    Address Qualification  Salary
4      Gaurav   22  Allahabad           MCA    1000
5     Dushyen   32    Kannuaj           Phd    2000
6  Sanjeevani   12  Allahabad          Bcom    3000
7  Manoranjan   52    Kannuaj        B.hons    4000

                Name  Age    Address Qualification  Mobile No  Salary
DataF1 0      Pravin   27     Nagpur           Msc       97.0     NaN
       1       Rayan   24     Kanpur            MA       91.0     NaN
       2       Sagar   22  Allahabad           MCA       58.0     NaN
       3       Inder   32    Kannuaj           Phd       76.0     NaN
DataF2 4      Gaurav   22  Allahabad           MCA        NaN  1000.0
       5     Dushyen   32    Kannuaj           Phd        NaN  2000.0
       6  Sanjeevani   12  Allahabad          Bcom        NaN  3000.0
       7  Manoranjan   52    Kannuaj        B.hons        NaN  4000.0

<hr/>

**Merging a dataframe with one unique key combination**

In [76]:
# Define a dictionary containing employee data 
emp_obj_1 = {'key': ['Pravin', 'Rayan', 'Sagar', 'Inder'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
         'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
emp_obj_2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
         'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(emp_obj_1)
 
# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_1) 
  
 
print(df_obj_1, "\n\n", df_obj_2) 

# using .merge() function
res_df = pd.merge(df_obj_1, df_obj_2, on='key')
 
res_df

      key    Name  Age
0  Pravin     Jai   27
1   Rayan  Princi   24
2   Sagar  Gaurav   22
3   Inder    Anuj   32

       key    Name  Age
0  Pravin     Jai   27
1   Rayan  Princi   24
2   Sagar  Gaurav   22
3   Inder    Anuj   32

      key  Name_x  Age_x  Name_y  Age_y
0  Pravin     Jai     27     Jai     27
1   Rayan  Princi     24  Princi     24
2   Sagar  Gaurav     22  Gaurav     22
3   Inder    Anuj     32    Anuj     32

**Merging dataframe using multiple join keys**

In [77]:
# Define a dictionary containing employee data 
emp_obj_1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
        'Age':[27, 24, 22, 32],} 

# Define a dictionary containing employee data 
emp_obj_2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 

# Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(emp_obj_1)

# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2) 


print(df_obj_1, "\n\n", df_obj_2) 

# merging dataframe using multiple keys
res_df = pd.merge(df_obj_1, df_obj_1, on=['key', 'key1'])

res_df

  key key1    Name  Age
0  K0   K0  Pravin   27
1  K1   K1   Rayan   24
2  K2   K0   Sagar   22
3  K3   K1   Inder   32

   key key1    Address Qualification
0  K0   K0  Allahabad         Btech
1  K1   K0    Kannuaj           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

  key key1  Name_x  Age_x  Name_y  Age_y
0  K0   K0  Pravin     27  Pravin     27
1  K1   K1   Rayan     24   Rayan     24
2  K2   K0   Sagar     22   Sagar     22
3  K3   K1   Inder     32   Inder     32

**Merging dataframe using how in an argument**

In [78]:
# Now we set how = 'left' in order to use keys from left frame only.

# using keys from left frame
res_df = pd.merge(df_obj_1, df_obj_1,  how='left', on=['key', 'key1'])
print("\n")
print(res_df)

# Now we set how = 'right' in order to use keys from right frame only.

# using keys from left frame
res_df = pd.merge(df_obj_1, df_obj_1,  how='right', on=['key', 'key1'])
print("\n")
print(res_df)

# Now we set how = 'outer' in order to get union of keys from dataframes.

# using keys from left frame
res_df = pd.merge(df_obj_1, df_obj_1,  how='outer', on=['key', 'key1'])
print("\n")
print(res_df)

# Now we set how = 'inner' in order to get intersection of keys from dataframes.

# using keys from left frame
res_df = pd.merge(df_obj_1, df_obj_1,  how='inner', on=['key', 'key1'])
print("\n")
print(res_df)

  key key1  Name_x  Age_x  Name_y  Age_y
0  K0   K0  Pravin     27  Pravin     27
1  K1   K1   Rayan     24   Rayan     24
2  K2   K0   Sagar     22   Sagar     22
3  K3   K1   Inder     32   Inder     32


  key key1  Name_x  Age_x  Name_y  Age_y
0  K0   K0  Pravin     27  Pravin     27
1  K1   K1   Rayan     24   Rayan     24
2  K2   K0   Sagar     22   Sagar     22
3  K3   K1   Inder     32   Inder     32


  key key1  Name_x  Age_x  Name_y  Age_y
0  K0   K0  Pravin     27  Pravin     27
1  K1   K1   Rayan     24   Rayan     24
2  K2   K0   Sagar     22   Sagar     22
3  K3   K1   Inder     32   Inder     32


  key key1  Name_x  Age_x  Name_y  Age_y
0  K0   K0  Pravin     27  Pravin     27
1  K1   K1   Rayan     24   Rayan     24
2  K2   K0   Sagar     22   Sagar     22
3  K3   K1   Inder     32   Inder     32

<hr />

**Joining DataFrame**

In [79]:
# Define a dictionary containing employee data 
emp_obj_1 = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
             'Age':[27, 24, 22, 32]} 

# Define a dictionary containing employee data 
emp_obj_2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
             'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 

# Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(emp_obj_1,index=['K0', 'K1', 'K2', 'K3'])

# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2, index=['K0', 'K2', 'K3', 'K4'])


print(df_obj_1, "\n\n", df_obj_2)  

# joining dataframe
res_df_1 = df_obj_1.join(df_obj_2)

res_df_1

      Name  Age
K0  Pravin   27
K1   Rayan   24
K2   Sagar   22
K3   Inder   32

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

      Name  Age    Address Qualification
K0  Pravin   27  Allahabad           MCA
K1   Rayan   24        NaN           NaN
K2   Sagar   22    Kannuaj           Phd
K3   Inder   32  Allahabad          Bcom

In [80]:
# Now we use how = 'outer' in order to get union

# Getting union
res_df_1 = df_obj_1.join(df_obj_2, how='outer')
res_df_1

      Name   Age    Address Qualification
K0  Pravin  27.0  Allahabad           MCA
K1   Rayan  24.0        NaN           NaN
K2   Sagar  22.0    Kannuaj           Phd
K3   Inder  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

In [81]:
# Now we use how = 'inner' in order to get union

# Getting union
res_df_1 = df_obj_1.join(df_obj_2, how='inner')
res_df_1

      Name  Age    Address Qualification
K0  Pravin   27  Allahabad           MCA
K2   Sagar   22    Kannuaj           Phd
K3   Inder   32  Allahabad          Bcom

In [82]:
# Joining dataframe using **on** in an argument

# Define a dictionary containing employee data 
emp_obj_1 = {'Name':['Pravin', 'Rayan', 'Sagar', 'Inder'], 
        'Age':[27, 24, 22, 32],
        'Key':['K0', 'K1', 'K2', 'K3']} 
    
# Define a dictionary containing employee data 
emp_obj_2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df_obj_1 = pd.DataFrame(emp_obj_1)
  
# Convert the dictionary into DataFrame  
df_obj_2 = pd.DataFrame(emp_obj_2, index=['K0', 'K2', 'K3', 'K4'])
 
print(df_obj_1, "\n\n", df_obj_2)

# using on argument in join
res_df = df_obj_1.join(df_obj_2, on='Key')
 
res_df

     Name  Age Key
0  Pravin   27  K0
1   Rayan   24  K1
2   Sagar   22  K2
3   Inder   32  K3

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

     Name  Age Key    Address Qualification
0  Pravin   27  K0  Allahabad           MCA
1   Rayan   24  K1        NaN           NaN
2   Sagar   22  K2    Kannuaj           Phd
3   Inder   32  K3  Allahabad          Bcom